# parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple

# anchors
anchors:
  - [5,6, 7,11, 15,12]  # P3/8
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

#  - [ 19,27,  44,40,  38,94 ]  # P3/8
#  - [ 96,68,  86,152,  180,137 ]  # P4/16
#  - [ 140,301,  303,264,  238,542 ]  # P5/32
#  - [ 436,615,  739,380,  925,792 ]  # P6/64

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, Conv, [16, 5, 4]],  # 0
   [-1, 1, Conv, [32, 3, 2]],  # 1
   [-1, 1, Conv, [32, 3, 1]],  # 2
   [-1, 1, Conv, [64, 3, 2]],  # 3
   [-1, 1, Conv, [64, 3, 1]],  # 4
   [-1, 1, Conv, [128, 3, 2]],  # 5
   [-1, 1, Conv, [128, 3, 1]],  # 6
   [-1, 1, Block_att, [128]],       # 7
   [-1, 1, Block_att, [128]],       # 8
   [-1, 1, Block_att, [128]],       # 9
   #[-1, 1, Block_att, [128]],       # 10
   #[-1, 1, Block_att, [128]],       # 11
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [128, 1, 1]],  # 10
   [-1, 1, Conv, [128, 3, 2]],  # 11
   [-1, 1, Conv, [256, 3, 1]],  # 12
   [-1, 1, Conv, [128, 1, 1]],  # 13
   [-1, 1, Conv, [128, 3, 2]],  # 14
   [-1, 1, Conv, [256, 3, 1]],  # 15

   [[4, 9, 12, 15], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
